pruebas/results/2025-11-10_17-13-27/S0_master_rw_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 179.74 qps: 3618.92 (r/w/o: 2536.50/721.34/361.07) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 201.82 qps: 4026.90 (r/w/o: 2818.41/804.86/403.63) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 204.40 qps: 4089.00 (r/w/o: 2861.00/819.20/408.80) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 215.21 qps: 4301.30 (r/w/o: 3010.07/860.82/430.41) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 209.60 qps: 4204.72 (r/w/o: 2943.94/841.58/419.19) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 219.20 qps: 4380.05 (r/w/o: 3068.23/873.41/438.40) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 221.40 qps: 4430.92 (r/w/o: 3101.55/886.58/442.79) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 210.21 qps: 4199.72 (r/w/o: 2939.28/840.02/420.41) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 212.39 qps: 4249.22 (r/w/o: 2976.07/848.36/424.78) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 217.81 qps: 4362.37 (r/w/o: 3051.12/875.63/435.62) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 213.00 qps: 4244.41 (r/w/o: 2971.01/847.60/425.80) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 198.19 qps: 3970.68 (r/w/o: 2780.31/793.78/396.59) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            175322
        write:                           50092
        other:                           25046
        total:                           250460
    transactions:                        12523  (208.61 per sec.)
    queries:                             250460 (4172.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0285s
    total number of events:              12523

Latency (ms):
         min:                                    7.23
         avg:                                   38.34
         max:                                  463.62
         95th percentile:                       82.96
         sum:                               480086.28

Threads fairness:
    events (avg/stddev):           1565.3750/6.02
    execution time (avg/stddev):   60.0108/0.01