pruebas/results/2025-11-10_17-13-27/S0_master_wo_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 148.94 qps: 894.66 (r/w/o: 0.00/596.57/298.09) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 121.81 qps: 730.68 (r/w/o: 0.00/487.05/243.63) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 124.80 qps: 748.22 (r/w/o: 0.00/498.61/249.61) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 130.79 qps: 785.57 (r/w/o: 0.00/523.98/261.59) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 135.20 qps: 811.00 (r/w/o: 0.00/540.60/270.40) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 137.00 qps: 822.21 (r/w/o: 0.00/548.21/274.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 131.80 qps: 790.83 (r/w/o: 0.00/527.22/263.61) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 135.00 qps: 809.18 (r/w/o: 0.00/539.19/269.99) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 136.80 qps: 821.60 (r/w/o: 0.00/548.00/273.60) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 140.60 qps: 843.62 (r/w/o: 0.00/562.41/281.21) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 138.20 qps: 829.19 (r/w/o: 0.00/552.80/276.40) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 133.39 qps: 800.36 (r/w/o: 0.00/533.58/266.79) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           32292
        other:                           16146
        total:                           48438
    transactions:                        8073   (134.53 per sec.)
    queries:                             48438  (807.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0060s
    total number of events:              8073

Latency (ms):
         min:                                    3.25
         avg:                                    7.43
         max:                                   82.54
         95th percentile:                       13.46
         sum:                                59980.42

Threads fairness:
    events (avg/stddev):           8073.0000/0.00
    execution time (avg/stddev):   59.9804/0.00