pruebas/results/2025-11-10_17-13-27/S0_master_wo_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 189.95 qps: 1142.07 (r/w/o: 0.00/761.38/380.69) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 176.59 qps: 1058.56 (r/w/o: 0.00/705.37/353.19) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 190.41 qps: 1143.87 (r/w/o: 0.00/763.04/380.82) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 181.40 qps: 1087.81 (r/w/o: 0.00/725.00/362.80) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 194.19 qps: 1164.75 (r/w/o: 0.00/776.37/388.38) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 179.01 qps: 1074.63 (r/w/o: 0.00/716.62/358.01) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 188.00 qps: 1128.21 (r/w/o: 0.00/752.21/376.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 186.00 qps: 1115.59 (r/w/o: 0.00/743.59/372.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 188.00 qps: 1127.81 (r/w/o: 0.00/751.80/376.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 194.20 qps: 1167.21 (r/w/o: 0.00/778.81/388.40) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 188.80 qps: 1131.98 (r/w/o: 0.00/754.39/377.59) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 194.00 qps: 1162.42 (r/w/o: 0.00/774.41/388.01) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           45028
        other:                           22514
        total:                           67542
    transactions:                        11257  (187.46 per sec.)
    queries:                             67542  (1124.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0487s
    total number of events:              11257

Latency (ms):
         min:                                    3.88
         avg:                                   21.33
         max:                                  101.57
         95th percentile:                       38.25
         sum:                               240059.48

Threads fairness:
    events (avg/stddev):           2814.2500/16.63
    execution time (avg/stddev):   60.0149/0.01