pruebas/results/2025-11-10_17-13-27/S0_master_wo_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 238.69 qps: 1435.15 (r/w/o: 0.00/956.17/478.98) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 235.44 qps: 1413.45 (r/w/o: 0.00/942.56/470.88) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 243.01 qps: 1461.64 (r/w/o: 0.00/975.62/486.01) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 248.40 qps: 1490.00 (r/w/o: 0.00/993.20/496.80) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 247.80 qps: 1485.79 (r/w/o: 0.00/990.20/495.60) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 251.60 qps: 1508.82 (r/w/o: 0.00/1005.61/503.21) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 239.20 qps: 1435.99 (r/w/o: 0.00/957.59/478.40) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 247.99 qps: 1486.77 (r/w/o: 0.00/990.78/495.99) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 254.20 qps: 1525.02 (r/w/o: 0.00/1016.61/508.41) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 250.60 qps: 1505.21 (r/w/o: 0.00/1004.00/501.20) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 253.20 qps: 1518.19 (r/w/o: 0.00/1011.80/506.40) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 241.00 qps: 1448.61 (r/w/o: 0.00/966.61/482.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           59056
        other:                           29528
        total:                           88584
    transactions:                        14764  (246.03 per sec.)
    queries:                             88584  (1476.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0089s
    total number of events:              14764

Latency (ms):
         min:                                    4.98
         avg:                                   32.51
         max:                                  131.82
         95th percentile:                       51.02
         sum:                               479978.49

Threads fairness:
    events (avg/stddev):           1845.5000/8.08
    execution time (avg/stddev):   59.9973/0.00